eisup_2019_docmng_integration/src/Documents/ttk_РаспоряжениеНаЗакупку/ttk_РаспоряжениеНаЗакупку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ttk_РаспоряжениеНаЗакупку</name>
  <registerRecords>AccumulationRegister.ttk_ОстаткиЛимитовПоДоговорам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРаспоряжения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРаспоряжения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыПервичныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодКонтроля</name>
    <comment>1-по текущему договору; 2-по основному договору</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/ttk_ЛимитыПоДоговорам/ttk_ЛимитыПоДоговорам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ttk_ЛимитыПоДоговорам</name>
  <resources>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </resources>
  <attributes>
    <name>МетодКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыПервичныхДокументов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef.ttk_РаспоряжениеНаЗакупку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/AccumulationRegisters/ttk_ОстаткиЛимитовПоДоговорам/ttk_ОстаткиЛимитовПоДоговорам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ttk_ОстаткиЛимитовПоДоговорам</name>
  <resources>
    <name>СуммаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef.ttk_РаспоряжениеНаЗакупку</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ИзменениеСтатусовПервичныхДокументов/абс_ИзменениеСтатусовПервичныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ИзменениеСтатусовПервичныхДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьОтветственного</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ПервичныйДокумент</name>
    <type>
      <types>DocumentRef.ОприходованиеТоваров</types>
      <types>DocumentRef.ttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикам</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.kwr_ИнтеграцияСHyperion</types>
      <types>DocumentRef.ttk_ЗагрузкаНачисленийИзБиллинга</types>
      <types>DocumentRef.ttk_НастройкаСоответствияСчетовБУКСтатьямВГО</types>
      <types>DocumentRef.ТребованиеНакладная</types>
      <types>DocumentRef.ttk_ДекларацияБиллинг</types>
      <types>DocumentRef.абс_НеотфактурованнаяПоставка</types>
      <types>DocumentRef.ttk_НастройкаСоответствияКонтрагентовЕИСУПиВГО</types>
      <types>DocumentRef.ПередачаТоваров</types>
      <types>DocumentRef.ttk_РаспоряжениеНаЗакупку</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ВозвратПереданныхТоваров</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.КорректировкаПоступления</types>
      <types>DocumentRef.ttk_ПроектКорректировкиДога</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ttk_ОтражениеСтатейБюджетаВРазделыПланаПлатежей</types>
      <types>DocumentRef.ttk_СверкаВГО</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.Абс_АктПриёмкиВыполненныхРабот</types>
      <types>DocumentRef.КомплектацияНоменклатуры</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.СписаниеТоваров</types>
      <types>DocumentRef.ПолучениеУслугПоПереработке</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.абс_СтатусыПервичныхДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Documents/ttk_РаспоряжениеНаЗакупку/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Лимит = РегистрыСведений.ttk_ЛимитыПоДоговорам.СоздатьМенеджерЗаписи();
	Лимит.Организация = Организация;
	Лимит.Контрагент = Контрагент;
	Если МетодКонтроля = 2 И ЗначениеЗаполнено(ДополнительныеСвойства.ОсновнойДоговор) Тогда
		Лимит.ДоговорКонтрагента = ДополнительныеСвойства.ОсновнойДоговор;
	Иначе 
		Лимит.ДоговорКонтрагента = ДоговорКонтрагента;
	КонецЕсли;
	Лимит.Распоряжение = Ссылка;
	Лимит.Прочитать();		
	Лимит.Организация = Организация;
	Лимит.Контрагент = Контрагент;
	Лимит.ДоговорКонтрагента = ДоговорКонтрагента;
	Лимит.Распоряжение = Ссылка;
	Лимит.НачалоПериода = НачалоПериода;
	Лимит.ОкончаниеПериода = ОкончаниеПериода;
	Лимит.МетодКонтроля = МетодКонтроля;
	Лимит.Статус = Статус;
	Лимит.СуммаБезНДС = СуммаБезНДС;
	Лимит.СуммаНДС = СуммаНДС;
	Лимит.СуммаСНДС = Сумма;
	Лимит.СтавкаНДС = СтавкаНДС;
	Лимит.Валюта = Валюта;
	Лимит.Записать();
		
	//
	Если Статус = Перечисления.абс_СтатусыПервичныхДокументов.Согласован Тогда
		Движения.ttk_ОстаткиЛимитовПоДоговорам.Записывать = Истина;
		Движение = Движения.ttk_ОстаткиЛимитовПоДоговорам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = НачалоПериода;
		Движение.Организация = Организация;
		Движение.Контрагент = Контрагент;
		Если МетодКонтроля = 2 И ЗначениеЗаполнено(ДополнительныеСвойства.ОсновнойДоговор) Тогда
			Движение.Договор = ДополнительныеСвойства.ОсновнойДоговор;
		Иначе 
			Движение.Договор = ДоговорКонтрагента;
		КонецЕсли;		
		Движение.СуммаБезНДС = СуммаБезНДС;
		Движение.СуммаНДС = СуммаНДС;
		Движение.СуммаСНДС = Сумма;
		Движение.Валюта = Валюта;
		Движение.Распоряжение = Ссылка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//Записшем статусы согласования в регистр.
	ТекПользователь = глЗначениеПеременной("глТекущийПользователь");
	
	НаборЗаписей = РегистрыСведений.абс_ИзменениеСтатусовПервичныхДокументов.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.ПервичныйДокумент.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период = абс_СерверныеФункции.ПолучитьДатуСервера(); //ТекущаяДата();  АБС Коломиец 17233
	Запись.ПервичныйДокумент = Ссылка;
	Запись.Пользователь = ТекПользователь;	
	Запись.СтатусДокумента = Статус;	
	Запись.Комментарий = Комментарий;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Сообщение = Новый СообщениеПользователю;
	
	ОтказЗаписи = Документы.ttk_РаспоряжениеНаЗакупку.ПроверитьВозможностьЗаписиДокумента(Ссылка, МетодКонтроля, НачалоПериода, ОкончаниеПериода);
	Если ОтказЗаписи.Количество() > 0 Тогда
		Сообщение.Текст = ОтказЗаписи.ТекстСообщения;
		Сообщение.Поле = ОтказЗаписи.Поле;
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		ПроверяемыеРеквизиты.Удалить(МетодКонтроля);
		Отказ = ОтказЗаписи.Отказ;		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Организация = ДанныеЗаполнения.Организация;
		Контрагент = ДанныеЗаполнения.Контрагент;
		ДоговорКонтрагента = ДанныеЗаполнения.ДоговорКонтрагента;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Статус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка;
		Ответственный = глЗначениеПеременной("глТекущийПользователь");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = ТекущаяДата();
	Статус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка;
	НомерРаспоряжения = "";
	ДатаРаспоряжения = Дата(1,1,1);
	МетодКонтроля = 0;
	НачалоПериода = Дата(1,1,1);
	ОкончаниеПериода = Дата(1,1,1);
	СуммаБезНДС = 0;
	СуммаНДС = 0;
	Сумма = 0;
	Комментарий = "";
	
КонецПроцедуры
